#include"Interception.h"


//---------------------------------------
// コンストラクタ
//---------------------------------------
Interception::Interception() {

}

//---------------------------------------
// デストラクタ
//---------------------------------------
Interception::~Interception() {

}

//---------------------------------------
// 初期設定
//---------------------------------------
void Interception::Initialize() {

}

//---------------------------------------
// 処理
//---------------------------------------
void Interception::Update() {
	m_Vr = m_Vp - m_Ve;
	m_Sr = m_Sp - m_Se;
	m_Tc = m_Sr / m_Vr ;

	m_point = m_Sp + m_Vp * m_Tc;
}